---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCImportOptions.Dispose
source: html/fc622f9f-c5df-7755-e519-71d663b2ae40.htm
---
# Autodesk.Revit.DB.IFC.IFCImportOptions.Dispose Method

Releases all resources used by the IFCImportOptions

## Syntax (C#)
```csharp
public void Dispose()
```